import React, { Component } from 'react';
import { DetailWrapper, Header, Content } from './style';

class Detail extends Component {
    render() {
        return (
            <DetailWrapper>
                <Header>写文两年后，我成为了自己喜欢的模样</Header>
                <Content>
                    <img src='//upload-images.jianshu.io/upload_images/4460877-53ed65259bfc395a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1000/format/webp' />
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                    <p>我也忘了哪天，突然间不在简书更文了。究其原因，一是我太在乎别人的看法，当时以恶意揣测我的人太多；二是因为发生了一些事情，对写文的人以及看文的人都产生了一个信仰崩塌。三是因为，我太忙了。</p>
                </Content>
            </DetailWrapper>
        )
    }
}

export default Detail;